{
  "id": "home-page",
  "title": "home page",
  "desciption": "Design pattern for FE developer use (Nunjucks, Sass, Vue and Javascript)",
  "keywords": "Gulp, Nunjucks, Sass, Vue, Javascript",
  "body_class_name": "home-page",
  "response": {
    "success": false,
    "error": {},
    "data": {
      "product_list": [
        {
          "logo": "gulp-logo-fixed.png",
          "title": "Gulp",
          "short_desc": "A toolkit to automate & enhance your workflow",
          "desc": "Leverage gulp and the flexibility of JavaScript to automate slow, repetitive workflows and compose them into efficient build pipelines.",
          "url": "https://gulpjs.com"
        },
        {
          "logo": "njk-logo-fixed.png",
          "title": "Nunjuck",
          "short_desc": "Nunjucks is a full featured templating engine for javascript",
          "desc": "Nunjucks has allowed us to port all of our existing templates from a Django project to something that's easier to manage. By moving our templates to the client, transfer sizes are reduced and page responsiveness increases significantly. Our API supplies data, meaning we can decouple testing the front-end from testing the back-end. Nunjucks has made our app feel native.",
          "url": "https://mozilla.github.io/nunjucks/"
        },
        {
          "logo": "sass-logo-fixed.png",
          "title": "Sass",
          "short_desc": "Sass is the most mature, stable, and powerful professional grade CSS extension language in the world.",
          "desc": "Sass is an extension of CSS, adding nested rules, variables, mixins, selector inheritance, and more. It's translated to well-formatted, standard CSS using the command line tool or a plugin for your build system.",
          "url": "https://sass-lang.com/"
        },
        {
          "logo": "js-logo-fixed.png",
          "title": "Javascript",
          "short_desc": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions",
          "desc": "JavaScript is among the most powerful and flexible programming languages of the web. It powers the dynamic behavior on most websites, including this one.",
          "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
        },
        {
          "logo": "vue-logo-fixed.png",
          "title": "VueJS",
          "short_desc": "Vue.js is an MIT-licensed open source project",
          "desc": "Vue.js is an MIT-licensed open source project with its ongoing development made possible entirely by the support of these awesome backers.",
          "url": "https://vuejs.org/"
        }
      ]
    }
  }
}
